#!/bin/bash
# Файл script.sh должен распологаться в корне проекта
# Напрмер, /home/pashok/Bshop/bshop
cd /home/pashok/.local/share/virtualenvs/backend-HHqXE5nk/bin
source activate
cd  /
cd  $HOME/Bshop/bshop/backend
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на авторизацию"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test appuser.tests.Authentication --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на регистрацию"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test appuser.tests.Registration --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение списка заказов пользователя"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.Orders --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на создание нового заказа"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.NewOrder --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на создание нового заказа"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.LoadListProducts --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение списка товаровв виде дерева"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.ProductsListsLimitOffset --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение списка товаров по методу limit-offset"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.ProductsListsNameProduct --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение списка товаров по наименованию товара"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.ProductsListsId --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение списка товаров по идентификатору с discount > 0"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.ProductDetail --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение атрибутов товара"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.KitsListLimitOffset --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение списка программ по методу limit-offset"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.KitsListNameKit --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение списка программ по названию программы"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.KitDetail --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение атрибутов программы"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.ComponentDetail --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение атрибутов активного компонента"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.CatDetail --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение атрибутов категории"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.SlideList --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение списка слайдов"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.CreateOrder --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на создание заказа"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.EditOrder --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на редактирование заказа"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.OrderDetails --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение атрибутов заказа"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.OrderList --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение списка заказов пользователя"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.GetCountries --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение списка стран"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.GetPvz --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение списка ПВЗ по индексу"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.GetShipmentDetails --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на расчет стоимости и способов доставки заказа"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.CreateAdvice --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на создание обращения"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.GetAdviceTypes --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение списка типов обращений"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.CheckPromo --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на проверка промокода на активность, получение его параметров"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.Get1cOrderList --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на редактирование заказа"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.Upload1cBb --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на загрузка из 1С изменений бонусных балансов"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.GetProductFeedback --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение отзывов о товаре"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.CreateProductFeedback --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на создание отзыва о товаре"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.CreateKitFeedback --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на создание отзыва о товаре"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.GetKitFeedback --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение отзывов о программе"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.GetMainKitFeedbacks --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение списка отзывов о программах для отображения на главной"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.ReceiveNotification --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на обработка оповещения об успешной оплате заказа от PayKeeper"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test shop.tests.GetPayLink --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение ссылки на оплату"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test appuser.tests.Logout --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на выход пользователя из системы"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test appuser.tests.ChangePassword --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на изменение пароля"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test appuser.tests.EmailPasswordRecovery --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на отправка ссылки на восстановление пароля на email пользователя"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test appuser.tests.ChangingUserProfile --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на изменение профиля пользователя"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test appuser.tests.GetUserProfile --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение данных профиля пользователя"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test appuser.tests.GetReferralOrders --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение списка реферральных заказов пользователя"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test appuser.tests.GetReferralsUser --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение списка реферралов пользователя"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test appuser.tests.AvatarUpload --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на загрузка аватара в профиль пользователя"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test appuser.tests.BonusToBalance --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на перенос средств с бонусного баланса на депозит"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test appuser.tests.BonusHistory --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение истории начислений/списаний с бонусного баланса пользователя"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test appuser.tests.RefLink --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на переход по реферральной ссылке"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test appuser.tests.User1c --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение пользовательских данных для 1С | Изменение бонусного баланса"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test blog.tests.ArticlesList --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение списка статей"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test blog.tests.ArticleDetail --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение контента статьи"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test support.tests.CreateSupportRequest --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на создание обращения в техподдержку"
echo "-----------------------------------------------------------------------------------------------------------------------"

./manage.py test support.tests.GetSupportRequestTypes --settings=cfg.devsettings --keepdb
echo "-----------------------------------------------------------------------------------------------------------------------"
echo "Тест на получение списка типов обращений в техподдержку"
echo "-----------------------------------------------------------------------------------------------------------------------"